In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1, 30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df1

   var1  var2  var3
0    18    24    27
1    11     9    25
2    21    12     5
3     2     1     8
4    18     9    20

In [2]:
df2 = df1 + 99

In [3]:
pd.concat([df1, df2])

   var1  var2  var3
0    18    24    27
1    11     9    25
2    21    12     5
3     2     1     8
4    18     9    20
0   117   123   126
1   110   108   124
2   120   111   104
3   101   100   107
4   117   108   119

In [4]:
pd.concat([df1, df2], ignore_index= True)

   var1  var2  var3
0    18    24    27
1    11     9    25
2    21    12     5
3     2     1     8
4    18     9    20
5   117   123   126
6   110   108   124
7   120   111   104
8   101   100   107
9   117   108   119

In [5]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [6]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [7]:
df2.columns = ["var1", "var2", "deg1"]

In [8]:
df2

   var1  var2  deg1
0   117   123   126
1   110   108   124
2   120   111   104
3   101   100   107
4   117   108   119

In [9]:
df1

   var1  var2  var3
0    18    24    27
1    11     9    25
2    21    12     5
3     2     1     8
4    18     9    20

In [10]:
pd.concat([df1, df2])

   var1  var2  var3   deg1
0    18    24  27.0    NaN
1    11     9  25.0    NaN
2    21    12   5.0    NaN
3     2     1   8.0    NaN
4    18     9  20.0    NaN
0   117   123   NaN  126.0
1   110   108   NaN  124.0
2   120   111   NaN  104.0
3   101   100   NaN  107.0
4   117   108   NaN  119.0

In [11]:
pd.concat([df1, df2], join ="inner") # kesişime göre değiştirdi

   var1  var2
0    18    24
1    11     9
2    21    12
3     2     1
4    18     9
0   117   123
1   110   108
2   120   111
3   101   100
4   117   108